householder.org
#+TITLE: Householder decomposition
#+DESCRIPTION: The Householder QR decomposition


#+HTML_DOCTYPE: html5
#+HTML_LINK_UP: index.html
#+HTML_LINK_HOME: ..
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../web/worg.css" />
#+HTML_HEAD_EXTRA: <link rel="shortcut icon" href="../web/panda.svg" type="image/x-icon">
#+HTML_MATHJAX: path: "../MathJax/MathJax.js?config=TeX-AMS_CHTML"
#+OPTIONS: html-style:nil
#+OPTIONS: num:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: html-scripts:nil

#+BEGIN_SRC clojure :results output silent :session :tangle src/morelinear/householder.clj
  (ns morelinear.householder
    (:require [clojure.core.matrix :refer :all]))
#+END_SRC

The Householder decomposition is an alternate method to the Gram-Schmidt decomposition for build a *QR* matrix pair. instead of building an orthonormal basis it takes a more direct approach similar to the Gaussian *LU* procedure by just zeroing out columns to get the desired shape. The difference from the *LU* is that now instead of using elementary matrices to do row operations to get zeroes we will restrict ourselves to using *elementary reflectors*.

** elementary reflector

An /elementary reflector/ does what's written on the label, it's a matrix/linear-system which when given a vector produces its reflection across a /N-1/ dimensional hyperplane (in 2D it's a line and in 3D it's a plane). In the next section we will deal with selecting the correct hyperplane, but for the time being we will just focus on building such a matrix. 

Their key property is that they're both /orthonormal/ and /symmetric/.
- *Orthonormal* :: their rows (and columns) form an orthogonal basis and each row (and column) is of unit length. As a consequence, given an orthonormal matrix *Q* its inverse will be its transpose. In *QQ^{T}* the off-diagonal terms will be inner products of different basis vectors. Since they're orthogonal these inner product will be zero. The diagonal elements will be inner products of vectors with themselves so it will equal to their length. Since the rows are all unit length the diagonal will be all ones. 
- *Symmetric* :: means that it's equal to its own transpose. As a consequence a /symmetric/ + /orthonormal/ matrix will be it's own inverse. ie. *QQ=I*. This makes some sense b/c reflecting something twice gives you the same things back.
- *A product of orthonormal matrices will be orthonormal* :: b/c given two orthonormal matrices *U* and *V* we can test for orthonormality: *(UV)(UV)^{T}=UVV^{T}U^{T}=I*

So if we carry out a series of reflections *Q_{k}..Q_{2}..Q_{1}A* we can combine them into one matrix *Q* which will be guaranteed to be orthonormal as well. It however /will not necessarily/ be a reflection matrix!


To build a reflector matrix we need to find a nice concise mechanism to define the hyperplane over which it reflects. If our space is *R^N* then the hyperplane will be *N-1* dimensions and at first blush we seem to need *N-1* vectors to define it. For instance in *3D* space any two vectors not on the same line will define a 2D plane (ie. *a*v_1 + b*v_2* for all /a/ and /b/). But this method doesn't really scale b/c as *N* increases so does the number of vectors you need. The shortcut is that actually all planes have vectors orthogonal to the hyper plane. These vectors all lie on the same line and we can just choose one, call it *u*, and let it represent that remaining *N^{th}* dimension. Now you can simply say that the hyperplane is all the vectors orthogonal to *u*. Or more formally, all vectors /not-in-the-span/ of *u* are the hyperplane

Now that we have a way to define a plane we need to work through the mechanics of relfecting an arbitrary vector *x* across the hyperplane. *x* can be broken up into two separate vectors: One that lies in the plane and one that is orthogonal to the plane. The component that lies in the plane is unaffected by the reflection while the component that is orthogonal is in the direction of *u* and is flipped by just getting its negative. To do this procedure mathematically we start with a vector *x* and subtract twice its component in the direction of the *u*:
 -  *u^{t}x*/||u||* is the amount of *x* in the direction of *u* (a scalar)
 -  *uu^{t}x/||u||^{2}* is the component *x* in the direction of *u* (a vector)
 -  Here we notice that we can subsitute the inner product *u^{t}u* for *||u||^2*
 -  *uu^{t}x/u^{t}u*
 -  *x - 2uu^{t}x/u^{t}u* is you subtracting that vector component twice to get its reflection
 -  *(I-2uu^{t}/u^{t}u)x* is how we'd factor the *x* back out
Notice how in the last step we managed to factor out the *x* , so we can subsitute it with any other vector to get a reflection. The matrix *(I-2uu^{t}/u^{t}u)* to its left is the reflector matrix. It's defined uniquely by *u* and is independent of *x*.

*Note:* We will see in the next section that thought it would make life easier, we can't safely assume *u* is unit length
#+BEGIN_SRC clojure :results output silent :session :tangle src/morelinear/householder.clj
  (defn elementary-reflector
    "Build a matrix that will reflect vector across the hyperplane orthogonal to REFLECTION-AXIS"
    [reflection-axis]
    (let [dimension (dimension-count reflection-axis 0)]
      (sub (identity-matrix dimension)
	   (mul (outer-product reflection-axis reflection-axis)
		(/ 2 (length-squared reflection-axis))))))
#+END_SRC
For example:
#+BEGIN_SRC clojure
  (pm (elementary-reflector [43.0 36.0 38.0 90.0]))
  ;; [[ 0.709 -0.244 -0.258 -0.610]
  ;;  [-0.244  0.796 -0.216 -0.511]
  ;;  [-0.258 -0.216  0.772 -0.539]
  ;;  [-0.610 -0.511 -0.539 -0.277]]
  ;; nil


  (pm (mmul (elementary-reflector [43.0 36.0 38.0 90.0])
	    [43.0 36.0 38.0 90.0]))
  ;; [-43.000 -36.000 -38.000 -90.000]
  ;; nil
#+END_SRC

