householder.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-08-03 Sat 21:45 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>MoreLinear: Householder decomposition</title>
<meta name="generator" content="Org mode">
<meta name="author" content="George Kontsevich">
<meta name="description" content="The Householder QR decomposition"
>
<link rel="stylesheet" type="text/css" href="../web/worg.css" />
<link rel="shortcut icon" href="../web/panda.svg" type="image/x-icon">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href=".."> HOME </a>
</div><div id="content">
<h1 class="title">MoreLinear: Householder decomposition</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2c66d3f">Householder QR</a>
<ul>
<li><a href="#orgb30c1a5">elementary reflector</a></li>
<li><a href="#orgbfd5334">elementary coordinate reflector</a></li>
<li><a href="#org49f82e5">Zeroing the first column</a></li>
<li><a href="#org0e7e3c4">Zeroing out the second column and so on..</a></li>
<li><a href="#org060db64">Getting the reflectors</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org2c66d3f" class="outline-2">
<h2 id="org2c66d3f">Householder QR</h2>
<div class="outline-text-2" id="text-org2c66d3f">
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">ns</span> <span style="color: #6434A3;">morelinear.householder</span>
  (<span style="color: #D0372D;">:require</span> [clojure.core.matrix <span style="color: #D0372D;">:refer</span> <span style="color: #D0372D;">:all</span><span style="color: #999999;">]))</span>
</pre>
</div>

<p>
The Householder decomposition is an alternate method to the Gram-Schmidt decomposition for build a <b>QR</b> matrix pair. instead of building an orthonormal basis it takes a more direct approach similar to the Gaussian <b>LU</b> procedure by just zeroing out columns to get the desired shape. The difference from the <b>LU</b> is that now instead of using elementary matrices to do row operations to get zeroes we will restrict ourselves to using <b>elementary reflectors</b>.
</p>
</div>

<div id="outline-container-orgb30c1a5" class="outline-3">
<h3 id="orgb30c1a5">elementary reflector</h3>
<div class="outline-text-3" id="text-orgb30c1a5">
<p>
An <i>elementary reflector</i> does what's written on the label, it's a matrix/linear-system which when given a vector produces its reflection across a <i>N-1</i> dimensional hyperplane (in 2D it's a line and in 3D it's a plane). In the next section we will deal with selecting the correct hyperplane, but for the time being we will just focus on building such a matrix. 
</p>

<p>
Their key property is that they're both <i>orthonormal</i> and <i>symmetric</i>.
</p>
<dl class="org-dl">
<dt><b>Orthonormal</b></dt><dd>their rows (and columns) form an orthogonal basis and each row (and column) is of unit length. As a consequence, given an orthonormal matrix <b>Q</b> its inverse will be its transpose. In <b>QQ<sup>T</sup></b> the off-diagonal terms will be inner products of different basis vectors. Since they're orthogonal these inner product will be zero. The diagonal elements will be inner products of vectors with themselves so it will equal to their length. Since the rows are all unit length the diagonal will be all ones.</dd>
<dt><b>Symmetric</b></dt><dd>means that it's equal to its own transpose. As a consequence a <i>symmetric</i> + <i>orthonormal</i> matrix will be it's own inverse. ie. <b>QQ=I</b>. This makes some sense b/c reflecting something twice gives you the same things back.</dd>
<dt><b>A product of orthonormal matrices will be orthonormal</b></dt><dd>b/c given two orthonormal matrices <b>U</b> and <b>V</b> we can test for orthonormality: <b>(UV)(UV)<sup>T</sup>=UVV<sup>T</sup>U<sup>T</sup>=I</b></dd>
</dl>

<p>
So if we carry out a series of reflections <b>Q<sub>k</sub>..Q<sub>2</sub>..Q<sub>1</sub>A</b> we can combine them into one matrix <b>Q</b> which will be guaranteed to be orthonormal as well. It however <i>will not necessarily</i> be a reflection matrix!
</p>


<p>
To build a reflector matrix we need to find a nice concise mechanism to define the hyperplane over which it reflects. If our space is <b>R<sup>N</sup></b> then the hyperplane will be <b>N-1</b> dimensions and at first blush we seem to need <b>N-1</b> vectors to define it. For instance in <b>3D</b> space any two vectors not on the same line will define a 2D plane (ie. <b>a*v<sub>1</sub> + b*v<sub>2</sub></b> for all <i>a</i> and <i>b</i>). But this method doesn't really scale b/c as <b>N</b> increases so does the number of vectors you need. The shortcut is that actually all planes have vectors orthogonal to the hyper plane. These vectors all lie on the same line and we can just choose one, call it <b>u</b>, and let it represent that remaining <b>N<sup>th</sup></b> dimension. Now you can simply say that the hyperplane is all the vectors orthogonal to <b>u</b>. Or more formally, all vectors <i>not-in-the-span</i> of <b>u</b> are the hyperplane
</p>

<p>
Now that we have a way to define a plane we need to work through the mechanics of relfecting an arbitrary vector <b>x</b> across the hyperplane. <b>x</b> can be broken up into two separate vectors: One that lies in the plane and one that is orthogonal to the plane. The component that lies in the plane is unaffected by the reflection while the component that is orthogonal is in the direction of <b>u</b> and is flipped by just getting its negative. To do this procedure mathematically we start with a vector <b>x</b> and subtract twice its component in the direction of the <b>u</b>:
</p>
<ul class="org-ul">
<li><b>u<sup>t</sup>x*/||u||</b> is the amount of <b>x</b> in the direction of <b>u</b> (a scalar)</li>
<li><b>uu<sup>t</sup>x/||u||<sup>2</sup></b> is the component <b>x</b> in the direction of <b>u</b> (a vector)</li>
<li>Here we notice that we can subsitute the inner product <b>u<sup>t</sup>u</b> for <b>||u||<sup>2</sup></b></li>
<li><b>uu<sup>t</sup>x/u<sup>t</sup>u</b></li>
<li><b>x - 2uu<sup>t</sup>x/u<sup>t</sup>u</b> is you subtracting that vector component twice to get its reflection</li>
<li><b>(I-2uu<sup>t</sup>/u<sup>t</sup>u)x</b> is how we'd factor the <b>x</b> back out</li>
</ul>
<p>
Notice how in the last step we managed to factor out the <b>x</b> , so we can subsitute it with any other vector to get a reflection. The matrix <b>(I-2uu<sup>t</sup>/u<sup>t</sup>u)</b> to its left is the reflector matrix. It's defined uniquely by <b>u</b> and is independent of <b>x</b>.
</p>

<p>
<b>Note:</b> We will see in the next section that thought it would make life easier, we can't safely assume <b>u</b> is unit length
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">elementary-reflector</span>
  <span style="color: #036A07;">"Build a matrix that will reflect vector across the hyperplane orthogonal to REFLECTION-AXIS"</span>
  [reflection-axis<span style="color: #999999;">]</span>
  (<span style="color: #0000FF;">let</span> [dimension (dimension-count reflection-axis 0<span style="color: #999999;">)]</span>
    (sub (identity-matrix dimension<span style="color: #999999;">)</span>
         (mul (outer-product reflection-axis reflection-axis<span style="color: #999999;">)</span>
              (/ 2 (length-squared reflection-axis<span style="color: #999999;">))))))</span>
</pre>
</div>
<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-clojure">(pm (elementary-reflector [43.0 36.0 38.0 90.0<span style="color: #999999;">]))</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[ 0.709 -0.244 -0.258 -0.610]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[-0.244  0.796 -0.216 -0.511]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[-0.258 -0.216  0.772 -0.539]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[-0.610 -0.511 -0.539 -0.277]]</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">nil</span>


(pm (mmul (elementary-reflector [43.0 36.0 38.0 90.0<span style="color: #999999;">])</span>
          [43.0 36.0 38.0 90.0<span style="color: #999999;">]))</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[-43.000 -36.000 -38.000 -90.000]</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">nil</span>
</pre>
</div>
</div>
</div>
