householder.org
** elementary coordinate reflector
Circling back to our original intent, we were trying to use reflectors to clear rows and build an upper triangular matrix (the *R* in the *QR*)

The first thing we want to do is have a way to zero out the first column of a matrix, ie *A_{ - ,1}*. We'd like to build a special elementary reflector *Q_{1}* that reflected that first column on to the elementary vector *e_{1}* (that's *[ 1 0 0 0.. 0 ]* ). If we had this matrix then *Q_{1}A* would leave everything under the the first column zeroed out.

Generalizing the problem a bi, this is a bit of an inversion of what we did in the previous section. Instead of taking a hyperplane and reflecting over it, we now know what we want to reflect and where we want to reflect it to - we just need to find the right plane to do it. This plane lies between where we start and where we want to reflect to. If you picture it in 2D space then you could take the two vectors add up their norms and you will get a vector that bisects them (forming a equilateral diamond shape with the point lieing on the bisecting line). In higher dimensions it will get a bit more complicated as you need more and more vectors. 

Fortunately we know we can define the plane with the orthogonal vector. To get that we just subtract the two vector norms and you will find that you get a vector orthogonal to that bisection vector/plane.

\begin{equation}
u = x - ||x||e_{1}
\end{equation}

Strain your brain and try to picture it in 2D and in 3D and it should make sense.

*TODO*: Maybe add a picture..

Once you an orthogonal vector to the bisecting plane, you just feed it into our previous function and get the reflection matrix

#+BEGIN_SRC clojure :results output silent :session :tangle src/morelinear/householder.clj
  (defn elementary-coordinate-reflector
   "Build a matrix that will reflect the INPUT-VECTOR on to the COORDINATE-AXIS"
   [input-vector coordinate-axis] 
   (let [vector-orthogonal-to-reflection-plane
         (sub input-vector
              (mul coordinate-axis
                   (length input-vector)))]
     (if (zero-matrix? vector-orthogonal-to-reflection-plane)
       ;; degenerate case where the input is on the coordinate axis
       (identity-matrix (dimension-count input-vector 0))
       ;; normal case
       (elementary-reflector vector-orthogonal-to-reflection-plane))))

#+END_SRC
For instance we can take some random vector and say we want to reflect it onto the *e_1*
#+BEGIN_SRC clojure
  (pm (elementary-coordinate-reflector [24 77 89 12]
				       [1 0 0 0]))
  ;; [[0.199  0.638  0.737  0.099]
  ;;  [0.638  0.492 -0.587 -0.079]
  ;;  [0.737 -0.587  0.321 -0.091]
  ;;  [0.099 -0.079 -0.091  0.988]]
  ;; nil
#+END_SRC
We got some seemingly random matrix out. If we then multiply it times out random vector, it reflects perfectly to *e_1*
#+BEGIN_SRC clojure
  (pm (mmul (elementary-coordinate-reflector [24 77 89 12]
					     [1 0 0 0])
	    [24 77 89 12])))
  ;; [120.706 -0.000 -0.000 -0.000]
  ;; nil
#+END_SRC


** Zeroing the first column

Now putting all the pieces together, given some matrix *A* we can get back a reflector to zero out its first column

#+BEGIN_SRC clojure :results output silent :session :tangle src/morelinear/householder.clj
  (defn first-column-reflector
    "Build a matrix that will reflect the first column of INPUT-MATRIX 
    on to the first elementary vector [ 1 0 0 .. 0 ]"
    [input-matrix]
    (elementary-coordinate-reflector (get-column input-matrix
						 0)
				     (get-row (identity-matrix (dimension-count input-matrix 0)) 0)))
#+END_SRC
This is really just a wrapper for the previous function. Now we can test it by writing out a random matrix and zeroing out its first column
#+BEGIN_SRC clojure
  (pm (first-column-reflector [[43.0 36.0 38.0 90.0]
			       [21.0 98.0 55.0 48.0]
			       [72.0 13.0 98.0 12.0]
			       [28.0 38.0 73.0 20.0]]))
  ;; [[0.473  0.231  0.792  0.308]
  ;;  [0.231  0.899 -0.348 -0.135]
  ;;  [0.792 -0.348 -0.192 -0.463]
  ;;  [0.308 -0.135 -0.463  0.820]]
  ;; nil


  (let [A [[43.0 36.0 38.0 90.0]
	   [21.0 98.0 55.0 48.0]
	   [72.0 13.0 98.0 12.0]
	   [28.0 38.0 73.0 20.0]]]
    (pm (mmul (first-column-reflector A)
	      A)))
  ;; [[90.874  61.690 130.830 69.349]
  ;;  [ 0.000  86.731  14.280 57.059]
  ;;  [-0.000 -25.637 -41.613 43.058]
  ;;  [ 0.000  22.975  18.706 32.078]]
  ;; nil
#+END_SRC

