householder.html

<div id="outline-container-orgbfd5334" class="outline-3">
<h3 id="orgbfd5334">elementary coordinate reflector</h3>
<div class="outline-text-3" id="text-orgbfd5334">
<p>
Circling back to our original intent, we were trying to use reflectors to clear rows and build an upper triangular matrix (the <b>R</b> in the <b>QR</b>)
</p>

<p>
The first thing we want to do is have a way to zero out the first column of a matrix, ie <b>A<sub> - ,1</sub></b>. We'd like to build a special elementary reflector <b>Q<sub>1</sub></b> that reflected that first column on to the elementary vector <b>e<sub>1</sub></b> (that's <b>[ 1 0 0 0.. 0 ]</b> ). If we had this matrix then <b>Q<sub>1</sub>A</b> would leave everything under the the first column zeroed out.
</p>

<p>
Generalizing the problem a bi, this is a bit of an inversion of what we did in the previous section. Instead of taking a hyperplane and reflecting over it, we now know what we want to reflect and where we want to reflect it to - we just need to find the right plane to do it. This plane lies between where we start and where we want to reflect to. If you picture it in 2D space then you could take the two vectors add up their norms and you will get a vector that bisects them (forming a equilateral diamond shape with the point lieing on the bisecting line). In higher dimensions it will get a bit more complicated as you need more and more vectors. 
</p>

<p>
Fortunately we know we can define the plane with the orthogonal vector. To get that we just subtract the two vector norms and you will find that you get a vector orthogonal to that bisection vector/plane.
</p>

\begin{equation}
u = x - ||x||e_{1}
\end{equation}

<p>
Strain your brain and try to picture it in 2D and in 3D and it should make sense.
</p>

<p>
<b>TODO</b>: Maybe add a picture..
</p>

<p>
Once you an orthogonal vector to the bisecting plane, you just feed it into our previous function and get the reflection matrix
</p>

<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">elementary-coordinate-reflector</span>
 <span style="color: #036A07;">"Build a matrix that will reflect the INPUT-VECTOR on to the COORDINATE-AXIS"</span>
 [input-vector coordinate-axis] 
 (<span style="color: #0000FF;">let</span> [vector-orthogonal-to-reflection-plane
       (sub input-vector
            (mul coordinate-axis
                 (length input-vector<span style="color: #999999;">)))]</span>
   (<span style="color: #0000FF;">if</span> (zero-matrix? vector-orthogonal-to-reflection-plane<span style="color: #999999;">)</span>
     <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">degenerate case where the input is on the coordinate axis</span>
     (identity-matrix (dimension-count input-vector 0<span style="color: #999999;">))</span>
     <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">normal case</span>
     (elementary-reflector vector-orthogonal-to-reflection-plane<span style="color: #999999;">))))</span>

</pre>
</div>
<p>
For instance we can take some random vector and say we want to reflect it onto the <b>e<sub>1</sub></b>
</p>
<div class="org-src-container">
<pre class="src src-clojure">(pm (elementary-coordinate-reflector [24 77 89 12<span style="color: #999999;">]</span>
                                     [1 0 0 0<span style="color: #999999;">]))</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[0.199  0.638  0.737  0.099]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.638  0.492 -0.587 -0.079]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.737 -0.587  0.321 -0.091]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.099 -0.079 -0.091  0.988]]</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">nil</span>
</pre>
</div>
<p>
We got some seemingly random matrix out. If we then multiply it times out random vector, it reflects perfectly to <b>e<sub>1</sub></b>
</p>
<div class="org-src-container">
<pre class="src src-clojure">(pm (mmul (elementary-coordinate-reflector [24 77 89 12<span style="color: #999999;">]</span>
                                           [1 0 0 0<span style="color: #999999;">])</span>
          [24 77 89 12<span style="color: #999999;">])))</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[120.706 -0.000 -0.000 -0.000]</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">nil</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-org49f82e5" class="outline-3">
<h3 id="org49f82e5">Zeroing the first column</h3>
<div class="outline-text-3" id="text-org49f82e5">
<p>
Now putting all the pieces together, given some matrix <b>A</b> we can get back a reflector to zero out its first column
</p>

<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">first-column-reflector</span>
  <span style="color: #036A07;">"Build a matrix that will reflect the first column of INPUT-MATRIX </span>
<span style="color: #036A07;">  on to the first elementary vector [ 1 0 0 .. 0 ]"</span>
  [input-matrix<span style="color: #999999;">]</span>
  (elementary-coordinate-reflector (get-column input-matrix
                                               0<span style="color: #999999;">)</span>
                                   (get-row (identity-matrix (dimension-count input-matrix 0)) 0<span style="color: #999999;">)))</span>
</pre>
</div>
<p>
This is really just a wrapper for the previous function. Now we can test it by writing out a random matrix and zeroing out its first column
</p>
<div class="org-src-container">
<pre class="src src-clojure">(pm (first-column-reflector [[43.0 36.0 38.0 90.0<span style="color: #999999;">]</span>
                             [21.0 98.0 55.0 48.0<span style="color: #999999;">]</span>
                             [72.0 13.0 98.0 12.0<span style="color: #999999;">]</span>
                             [28.0 38.0 73.0 20.0<span style="color: #999999;">]]))</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[0.473  0.231  0.792  0.308]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.231  0.899 -0.348 -0.135]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.792 -0.348 -0.192 -0.463]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.308 -0.135 -0.463  0.820]]</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">nil</span>


(<span style="color: #0000FF;">let</span> [A [[43.0 36.0 38.0 90.0<span style="color: #999999;">]</span>
         [21.0 98.0 55.0 48.0<span style="color: #999999;">]</span>
         [72.0 13.0 98.0 12.0<span style="color: #999999;">]</span>
         [28.0 38.0 73.0 20.0<span style="color: #999999;">]]]</span>
  (pm (mmul (first-column-reflector A<span style="color: #999999;">)</span>
            A<span style="color: #999999;">)))</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[90.874  61.690 130.830 69.349]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[ 0.000  86.731  14.280 57.059]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[-0.000 -25.637 -41.613 43.058]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[ 0.000  22.975  18.706 32.078]]</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">nil</span>
</pre>
</div>
</div>
</div>
