householder.org
** Zeroing out the second column and so on..

Now we hit a bit of a problem. You can use the same method to make some matrix *Q_2* that will zero out the second column, but when you combine the two and try doing *Q_{2}Q_{1}A* you will see that *Q_{2}* is messing up the first column - so we lose the progress we'd made in the first step. We may have gotten the first column to lie on the coordinate vector after *Q_{1}A*, but when you reflect it again it moves away from the coordinate vector b/c all columns are reflected at each step.

In the *LU* Gaussian Elimination method we didn't have this problem b/c clearing subsequent columns was guaranteed to leave you previous columns intact (b/c shuffling rows would just be moving around zeroes from the pervious columns). Now this guarantee is gone so we need to find a way to reflect some matrix columns and not others

The solution is thinking in terms of block matrices. When we say we need to clear the second column we can spell that out as : we want to take the result of our first reflector *Q_{1}A* and now clearing everything under the =(2,2)= position. To avoid touching the first column we construct *Q_{2}* with the following form:

 \begin{equation}
 Q_{2}
 \\=
 \begin{bmatrix}
 1 & 0\\
 0 & S_{ n-1, m-1 }\\
 \end{bmatrix}
 \end{equation}

Notice how when we multiply this matrix times *Q_{1}A* the first column is left untouched


 \begin{equation}
 Q_2(Q_1A)
 \\=
 \begin{bmatrix}
 1 & 0\\
 0 & S\\
 \end{bmatrix}
 \begin{bmatrix}
 (Q_{1}A)_{1,1} & (Q_{1}A)_{1,*}\\
 0 & (Q_{1}A)_{n-1,m-1}\\
 \end{bmatrix}
 \\=
 \begin{bmatrix}
 (Q_{1}A)_{1,1} & (Q_{1}A)_{1,*}\\
 0 & S(Q_{1}A)_{n-1,m-1}\\
 \end{bmatrix}
 \end{equation}

Now also notice that the =n-1 by m-1= submatrix *S* will multiple times a submatrix of *Q_{1}A* which has that =(2,2)= position now in the =(1,1)= position.

We've also got a bit of bonus b/c in the resulting matrix the only "new" entry we need to worry about is *S(Q_{1}A)_{n-1,m-1}* - the first column and row have remained the same. In this submatrix product we need to again clear the first column because it's the second column of our overall matrix. Choosing an appropriate *S* matrix to do it mirrors the process we used to clear the first column of *A* - the only difference being that the dimension is one smaller.

When tackling the third column we do this again, getting the next submatrix of *S(Q_{1}A)_{n-1,m-1}*. At each step we are reducing the first column, grabbing the result's submatrix and calling the procedure again - until we are out of things to reduce

#+BEGIN_SRC clojure :results output silent :session :tangle src/morelinear/householder.clj
  (defn reduce-to-r
    "Reduce a matrix to a lower triangular orthonormal matrix"
    [input-matrix]
    (if (or (= 1 (row-count input-matrix))
	    (= 1 (column-count input-matrix))) 
      input-matrix ;; base case
      (do (assign! input-matrix
		   (mmul (first-column-reflector input-matrix)
			 input-matrix))
	  (recur (submatrix input-matrix
			    1
			    (dec (row-count input-matrix))
			    1
			    (dec (column-count input-matrix)))))))
#+END_SRC

#+BEGIN_QUOTE
*Note*: 
- This ~submatrix~ function is interesting b/c it will not make a copy of the matrix. Instead it will return a matrix object that shares its underlying data/memory with the parent matrix. So as we reduce the submatrices, the orginal matrix is being reduced as well
- The ~mmul~ matrix multiplication will unfortunately produce a temporary intermediary matrix which will then get copied into the matrix/submatrix. Other more advanced matrix libraries may have ways to do this in-place.
#+END_QUOTE

Now to test it I'm reusing the same random matrix from the previous example:
#+BEGIN_SRC clojure
  (def A (mutable [[43.0 36.0 38.0 90.0]
		   [21.0 98.0 55.0 48.0]
		   [72.0 13.0 98.0 12.0]
		   [28.0 38.0 73.0 20.0]]))

  (pm A)
  ;; [[43.000 36.000 38.000 90.000]
  ;;  [21.000 98.000 55.000 48.000]
  ;;  [72.000 13.000 98.000 12.000]
  ;;  [28.000 38.000 73.000 20.000]]
  ;; nil
  (reduce-to-r A)

  (pm A)
  ;; [[90.874 61.690 130.830  69.349]
  ;;  [ 0.000 93.313  29.311  49.102]
  ;;  [-0.000  0.000  37.767 -48.089]
  ;;  [ 0.000 -0.000   0.000 -37.619]]
  ;; nil
#+END_SRC
If you looking at the result I got when running ~(first-column-reflector ..)~  then you'll see that the first column and row have been preserved as we expect.

