householder.html

<div id="outline-container-org0e7e3c4" class="outline-3">
<h3 id="org0e7e3c4">Zeroing out the second column and so on..</h3>
<div class="outline-text-3" id="text-org0e7e3c4">
<p>
Now we hit a bit of a problem. You can use the same method to make some matrix <b>Q<sub>2</sub></b> that will zero out the second column, but when you combine the two and try doing <b>Q<sub>2</sub>Q<sub>1</sub>A</b> you will see that <b>Q<sub>2</sub></b> is messing up the first column - so we lose the progress we'd made in the first step. We may have gotten the first column to lie on the coordinate vector after <b>Q<sub>1</sub>A</b>, but when you reflect it again it moves away from the coordinate vector b/c all columns are reflected at each step.
</p>

<p>
In the <b>LU</b> Gaussian Elimination method we didn't have this problem b/c clearing subsequent columns was guaranteed to leave you previous columns intact (b/c shuffling rows would just be moving around zeroes from the pervious columns). Now this guarantee is gone so we need to find a way to reflect some matrix columns and not others
</p>

<p>
The solution is thinking in terms of block matrices. When we say we need to clear the second column we can spell that out as : we want to take the result of our first reflector <b>Q<sub>1</sub>A</b> and now clearing everything under the <code>(2,2)</code> position. To avoid touching the first column we construct <b>Q<sub>2</sub></b> with the following form:
</p>

\begin{equation}
Q_{2}
\\=
\begin{bmatrix}
1 & 0\\
0 & S_{ n-1, m-1 }\\
\end{bmatrix}
\end{equation}

<p>
Notice how when we multiply this matrix times <b>Q<sub>1</sub>A</b> the first column is left untouched
</p>


\begin{equation}
Q_2(Q_1A)
\\=
\begin{bmatrix}
1 & 0\\
0 & S\\
\end{bmatrix}
\begin{bmatrix}
(Q_{1}A)_{1,1} & (Q_{1}A)_{1,*}\\
0 & (Q_{1}A)_{n-1,m-1}\\
\end{bmatrix}
\\=
\begin{bmatrix}
(Q_{1}A)_{1,1} & (Q_{1}A)_{1,*}\\
0 & S(Q_{1}A)_{n-1,m-1}\\
\end{bmatrix}
\end{equation}

<p>
Now also notice that the <code>n-1 by m-1</code> submatrix <b>S</b> will multiple times a submatrix of <b>Q<sub>1</sub>A</b> which has that <code>(2,2)</code> position now in the <code>(1,1)</code> position.
</p>

<p>
We've also got a bit of bonus b/c in the resulting matrix the only "new" entry we need to worry about is <b>S(Q<sub>1</sub>A)<sub>n-1,m-1</sub></b> - the first column and row have remained the same. In this submatrix product we need to again clear the first column because it's the second column of our overall matrix. Choosing an appropriate <b>S</b> matrix to do it mirrors the process we used to clear the first column of <b>A</b> - the only difference being that the dimension is one smaller.
</p>

<p>
When tackling the third column we do this again, getting the next submatrix of <b>S(Q<sub>1</sub>A)<sub>n-1,m-1</sub></b>. At each step we are reducing the first column, grabbing the result's submatrix and calling the procedure again - until we are out of things to reduce
</p>

<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">reduce-to-r</span>
  <span style="color: #036A07;">"Reduce a matrix to a lower triangular orthonormal matrix"</span>
  [input-matrix<span style="color: #999999;">]</span>
  (<span style="color: #0000FF;">if</span> (<span style="color: #0000FF;">or</span> (= 1 (row-count input-matrix<span style="color: #999999;">))</span>
          (= 1 (column-count input-matrix))) 
    input-matrix <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">base case</span>
    (<span style="color: #0000FF;">do</span> (assign! input-matrix
                 (mmul (first-column-reflector input-matrix<span style="color: #999999;">)</span>
                       input-matrix<span style="color: #999999;">))</span>
        (<span style="color: #0000FF;">recur</span> (submatrix input-matrix
                          1
                          (dec (row-count input-matrix<span style="color: #999999;">))</span>
                          1
                          (dec (column-count input-matrix<span style="color: #999999;">)))))))</span>
</pre>
</div>

<blockquote>
<p>
<b>Note</b>: 
</p>
<ul class="org-ul">
<li>This <code>submatrix</code> function is interesting b/c it will not make a copy of the matrix. Instead it will return a matrix object that shares its underlying data/memory with the parent matrix. So as we reduce the submatrices, the orginal matrix is being reduced as well</li>
<li>The <code>mmul</code> matrix multiplication will unfortunately produce a temporary intermediary matrix which will then get copied into the matrix/submatrix. Other more advanced matrix libraries may have ways to do this in-place.</li>
</ul>
</blockquote>

<p>
Now to test it I'm reusing the same random matrix from the previous example:
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">A</span> (mutable [[43.0 36.0 38.0 90.0<span style="color: #999999;">]</span>
                 [21.0 98.0 55.0 48.0<span style="color: #999999;">]</span>
                 [72.0 13.0 98.0 12.0<span style="color: #999999;">]</span>
                 [28.0 38.0 73.0 20.0<span style="color: #999999;">]]))</span>

(pm A<span style="color: #999999;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[43.000 36.000 38.000 90.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[21.000 98.000 55.000 48.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[72.000 13.000 98.000 12.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[28.000 38.000 73.000 20.000]]</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">nil</span>
(reduce-to-r A<span style="color: #999999;">)</span>

(pm A<span style="color: #999999;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[90.874 61.690 130.830  69.349]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[ 0.000 93.313  29.311  49.102]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[-0.000  0.000  37.767 -48.089]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[ 0.000 -0.000   0.000 -37.619]]</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">nil</span>
</pre>
</div>
<p>
If you looking at the result I got when running <code>(first-column-reflector ..)</code>  then you'll see that the first column and row have been preserved as we expect.
</p>
</div>
</div>
