householder.org
** Getting the reflectors

The last section managed to get the *R* in the *QR*. The next step is combining all these intermediary relfectors (those *S* matrices) into a matrix *Q*

This step it unfortunately not quite as elegant as the reduction (or I haven't found the right solution!). 

The easiest solution is to work backwards from the last iteration step where there reflector matrix is just *1*. Then going back up one iteration we would take *1* and combine it with the =first-column-reflector= we got at that step.. and so on up the iterations till we got to back to the *Q_{1}*. Unfortunately with this method we build up *Q* as we work back up the stack and after we have finished the reduction. So as we reduce we need to keep around all these intermediary reflector till we get the last one (the *1*). Only then can we combine them.

The better but uglier solution is to combine the reflectors as we go, starting with *Q_{1}*. At each iteration of the reduction we got a new ~(first-column-reflector .. )~ , and just like with *S* in the 2^{nd} column case, we pad the matrix and make it =n by n=

 \begin{equation}
 Q_{k}
 \\=
 \begin{bmatrix}
 I_{k-1,k-1} & 0\\
 0 & S_{n-k+1,n-k+1}\\
 \end{bmatrix}
 \end{equation}

In ~core.matrix~ there is a convenient ~(block-diagonal-matrix .. )~ function to handle making these

So far we've been looking at *Q_{1}Q_{2}* .. *Q_{n}A=R*, but ultimately we want to get to *A=QR*. The reflectors are their own inverse, so written out like that the equation remains easily invertable. While by contrast *Q^{-1}A=R* is not so easy to invert... b/c *Q^{-1}* may not be a reflector at all. So we flip the equation ahead of time *A=Q_{n}* .. *Q_{2}Q_{1}R* and we make sure to build *Q* in the right order *Q=Q_{1}Q_{2}* .. *Q_{1}*

#+BEGIN_SRC clojure :results output silent :session :tangle src/morelinear/householder.clj
  (defn householder-reduce-to-QR
    "Increase the dimension of a reflector by padding it with an identity matrix"
    [reduction-matrix input-matrix]
    (if (or (= 0 (row-count input-matrix))
	    (= 0 (column-count input-matrix)))
      reduction-matrix ;; base case
      (let [reflector (first-column-reflector input-matrix)]
	(do (assign! input-matrix
		     (mmul reflector
			   input-matrix))
	    (recur (mmul reduction-matrix
			 (block-diagonal-matrix [(identity-matrix (- (row-count reduction-matrix)
								     (row-count input-matrix)))
						 reflector]))
		   (submatrix input-matrix
			      1
			      (dec (row-count input-matrix))
			      1
			      (dec (column-count input-matrix))))))))

  (defn householder-QR
    "A wrapper for the real function"
    [input-matrix]
    (householder-reduce-to-QR (identity-matrix (row-count input-matrix))
			      input-matrix))
#+END_SRC
The function reduces the input matrix to *R* and returns *Q*.
#+BEGIN_SRC clojure
  (def A (mutable [[43.0 36.0 38.0 90.0]
		   [21.0 98.0 55.0 48.0]
		   [72.0 13.0 98.0 12.0]
		   [28.0 38.0 73.0 20.0]]))

  (def Q (householder-QR A))
  (pm Q)
  ;; [[0.473  0.073 -0.690 -0.543]
  ;;  [0.231  0.897 -0.041  0.374]
  ;;  [0.792 -0.384  0.149  0.450]
  ;;  [0.308  0.204  0.708 -0.602]]
  (pm A)
  ;; [[90.874 61.690 130.830  69.349]
  ;;  [ 0.000 93.313  29.311  49.102]
  ;;  [-0.000  0.000  37.767 -48.089]
  ;;  [ 0.000 -0.000   0.000 -37.619]]
  (pm (mmul Q A))
  ;; [[43.000 36.000 38.000 90.000]
  ;;  [21.000 98.000 55.000 48.000]
  ;;  [72.000 13.000 98.000 12.000]
  ;;  [28.000 38.000 73.000 20.000]]
#+END_SRC
Note that this all works perfectly well for fat (underdefined) and skinny (overdefined) matrices
#+BEGIN_SRC clojure
  (def A (mutable [[43.0 36.0 38.0]
		   [21.0 98.0 55.0]
		   [72.0 13.0 98.0]
		   [28.0 38.0 73.0]
		   [65.0 23.0 85.0]]))
  (def Q (householder-QR A))
  (pm Q)
  ;; [[0.385  0.122 -0.678 -0.578 -0.207]
  ;;  [0.188  0.907 -0.042  0.374 -0.024]
  ;;  [0.644 -0.295  0.170  0.373 -0.574]
  ;;  [0.251  0.233  0.713 -0.612 -0.025]
  ;;  [0.582 -0.147 -0.033  0.111  0.791]]
  (pm A)
  ;; [[111.727 63.557 155.862]
  ;;  [ -0.000 94.882  30.090]
  ;;  [ -0.000  0.000  37.799]
  ;;  [  0.000 -0.000   0.000]
  ;;  [ -0.000  0.000   0.000]]
  (pm (mmul Q A))
  ;; [[43.000 36.000 38.000]
  ;;  [21.000 98.000 55.000]
  ;;  [72.000 13.000 98.000]
  ;;  [28.000 38.000 73.000]
  ;;  [65.000 23.000 85.000]]

  (def A (mutable [[43.0 36.0 38.0 90.0 54.0]
		   [21.0 98.0 55.0 48.0 92.0]
		   [72.0 13.0 98.0 12.0 47.0]]))
  (def Q (householder-QR A))
  (pm Q)
  ;;  [[0.497  0.108 -0.861]
  ;; [0.243  0.935  0.258]
  ;; [0.833 -0.337  0.439]]
  (pm A)
  ;; [[86.452 52.538 113.878  66.418 88.349]
  ;;  [ 0.000 91.153  22.480  50.581 76.019]
  ;;  [-0.000  0.000  24.484 -59.818 -2.122]]
  (pm (mmul Q A))
  ;; [[43.000 36.000 38.000 90.000 54.000]
  ;;  [21.000 98.000 55.000 48.000 92.000]
  ;;  [72.000 13.000 98.000 12.000 47.000]]
#+END_SRC
In a more sophisticated linear algebra system you may want to keep the resulting *R* matrix as two separate submatrices b/c upper diagonal matrices can have more performant code associated with them
