householder.html

<div id="outline-container-org060db64" class="outline-3">
<h3 id="org060db64">Getting the reflectors</h3>
<div class="outline-text-3" id="text-org060db64">
<p>
The last section managed to get the <b>R</b> in the <b>QR</b>. The next step is combining all these intermediary relfectors (those <b>S</b> matrices) into a matrix <b>Q</b>
</p>

<p>
This step it unfortunately not quite as elegant as the reduction (or I haven't found the right solution!). 
</p>

<p>
The easiest solution is to work backwards from the last iteration step where there reflector matrix is just <b>1</b>. Then going back up one iteration we would take <b>1</b> and combine it with the <code>first-column-reflector</code> we got at that step.. and so on up the iterations till we got to back to the <b>Q<sub>1</sub></b>. Unfortunately with this method we build up <b>Q</b> as we work back up the stack and after we have finished the reduction. So as we reduce we need to keep around all these intermediary reflector till we get the last one (the <b>1</b>). Only then can we combine them.
</p>

<p>
The better but uglier solution is to combine the reflectors as we go, starting with <b>Q<sub>1</sub></b>. At each iteration of the reduction we got a new <code>(first-column-reflector .. )</code> , and just like with <b>S</b> in the 2<sup>nd</sup> column case, we pad the matrix and make it <code>n by n</code>
</p>

\begin{equation}
Q_{k}
\\=
\begin{bmatrix}
I_{k-1,k-1} & 0\\
0 & S_{n-k+1,n-k+1}\\
\end{bmatrix}
\end{equation}

<p>
In <code>core.matrix</code> there is a convenient <code>(block-diagonal-matrix .. )</code> function to handle making these
</p>

<p>
So far we've been looking at <b>Q<sub>1</sub>Q<sub>2</sub></b> .. <b>Q<sub>n</sub>A=R</b>, but ultimately we want to get to <b>A=QR</b>. The reflectors are their own inverse, so written out like that the equation remains easily invertable. While by contrast <b>Q<sup>-1</sup>A=R</b> is not so easy to invert&#x2026; b/c <b>Q<sup>-1</sup></b> may not be a reflector at all. So we flip the equation ahead of time <b>A=Q<sub>n</sub></b> .. <b>Q<sub>2</sub>Q<sub>1</sub>R</b> and we make sure to build <b>Q</b> in the right order <b>Q=Q<sub>1</sub>Q<sub>2</sub></b> .. <b>Q<sub>1</sub></b>
</p>

<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">householder-reduce-to-QR</span>
  <span style="color: #036A07;">"Increase the dimension of a reflector by padding it with an identity matrix"</span>
  [reduction-matrix input-matrix<span style="color: #999999;">]</span>
  (<span style="color: #0000FF;">if</span> (<span style="color: #0000FF;">or</span> (= 0 (row-count input-matrix<span style="color: #999999;">))</span>
          (= 0 (column-count input-matrix<span style="color: #999999;">)))</span>
    reduction-matrix <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">base case</span>
    (<span style="color: #0000FF;">let</span> [reflector (first-column-reflector input-matrix<span style="color: #999999;">)]</span>
      (<span style="color: #0000FF;">do</span> (assign! input-matrix
                   (mmul reflector
                         input-matrix<span style="color: #999999;">))</span>
          (<span style="color: #0000FF;">recur</span> (mmul reduction-matrix
                       (block-diagonal-matrix [(identity-matrix (- (row-count reduction-matrix<span style="color: #999999;">)</span>
                                                                   (row-count input-matrix<span style="color: #999999;">)))</span>
                                               reflector<span style="color: #999999;">]))</span>
                 (submatrix input-matrix
                            1
                            (dec (row-count input-matrix<span style="color: #999999;">))</span>
                            1
                            (dec (column-count input-matrix<span style="color: #999999;">))))))))</span>

(<span style="color: #0000FF;">defn</span> <span style="color: #006699;">householder-QR</span>
  <span style="color: #036A07;">"A wrapper for the real function"</span>
  [input-matrix<span style="color: #999999;">]</span>
  (householder-reduce-to-QR (identity-matrix (row-count input-matrix<span style="color: #999999;">))</span>
                            input-matrix<span style="color: #999999;">))</span>
</pre>
</div>
<p>
The function reduces the input matrix to <b>R</b> and returns <b>Q</b>.
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">A</span> (mutable [[43.0 36.0 38.0 90.0<span style="color: #999999;">]</span>
                 [21.0 98.0 55.0 48.0<span style="color: #999999;">]</span>
                 [72.0 13.0 98.0 12.0<span style="color: #999999;">]</span>
                 [28.0 38.0 73.0 20.0<span style="color: #999999;">]]))</span>

(<span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">Q</span> (householder-QR A<span style="color: #999999;">))</span>
(pm Q<span style="color: #999999;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[0.473  0.073 -0.690 -0.543]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.231  0.897 -0.041  0.374]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.792 -0.384  0.149  0.450]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.308  0.204  0.708 -0.602]]</span>
(pm A<span style="color: #999999;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[90.874 61.690 130.830  69.349]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[ 0.000 93.313  29.311  49.102]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[-0.000  0.000  37.767 -48.089]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[ 0.000 -0.000   0.000 -37.619]]</span>
(pm (mmul Q A<span style="color: #999999;">))</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[43.000 36.000 38.000 90.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[21.000 98.000 55.000 48.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[72.000 13.000 98.000 12.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[28.000 38.000 73.000 20.000]]</span>
</pre>
</div>
<p>
Note that this all works perfectly well for fat (underdefined) and skinny (overdefined) matrices
</p>
<div class="org-src-container">
<pre class="src src-clojure">(<span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">A</span> (mutable [[43.0 36.0 38.0<span style="color: #999999;">]</span>
                 [21.0 98.0 55.0<span style="color: #999999;">]</span>
                 [72.0 13.0 98.0<span style="color: #999999;">]</span>
                 [28.0 38.0 73.0<span style="color: #999999;">]</span>
                 [65.0 23.0 85.0<span style="color: #999999;">]]))</span>
(<span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">Q</span> (householder-QR A<span style="color: #999999;">))</span>
(pm Q<span style="color: #999999;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[0.385  0.122 -0.678 -0.578 -0.207]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.188  0.907 -0.042  0.374 -0.024]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.644 -0.295  0.170  0.373 -0.574]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.251  0.233  0.713 -0.612 -0.025]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[0.582 -0.147 -0.033  0.111  0.791]]</span>
(pm A<span style="color: #999999;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[111.727 63.557 155.862]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[ -0.000 94.882  30.090]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[ -0.000  0.000  37.799]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[  0.000 -0.000   0.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[ -0.000  0.000   0.000]]</span>
(pm (mmul Q A<span style="color: #999999;">))</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[43.000 36.000 38.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[21.000 98.000 55.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[72.000 13.000 98.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[28.000 38.000 73.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[65.000 23.000 85.000]]</span>

(<span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">A</span> (mutable [[43.0 36.0 38.0 90.0 54.0<span style="color: #999999;">]</span>
                 [21.0 98.0 55.0 48.0 92.0<span style="color: #999999;">]</span>
                 [72.0 13.0 98.0 12.0 47.0<span style="color: #999999;">]]))</span>
(<span style="color: #0000FF;">def</span> <span style="color: #BA36A5;">Q</span> (householder-QR A<span style="color: #999999;">))</span>
(pm Q<span style="color: #999999;">)</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[[0.497  0.108 -0.861]</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[0.243  0.935  0.258]</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[0.833 -0.337  0.439]]</span>
(pm A<span style="color: #999999;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[86.452 52.538 113.878  66.418 88.349]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[ 0.000 91.153  22.480  50.581 76.019]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[-0.000  0.000  24.484 -59.818 -2.122]]</span>
(pm (mmul Q A<span style="color: #999999;">))</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">[[43.000 36.000 38.000 90.000 54.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[21.000 98.000 55.000 48.000 92.000]</span>
<span style="color: #8D8D84;">;;  </span><span style="color: #8D8D84; font-style: italic;">[72.000 13.000 98.000 12.000 47.000]]</span>
</pre>
</div>
<p>
In a more sophisticated linear algebra system you may want to keep the resulting <b>R</b> matrix as two separate submatrices b/c upper diagonal matrices can have more performant code associated with them
</p>
</div>
</div>
</div>
</div>
</body>
</html>
